      /if defined(SVPRIV_H)
      /eof
      /endif
      /define SVPRIV_H

      * Poliza Inexistente...
     D SVPRIV_POLNE    c                   const(0001)

     * - Estructura de PAHER0 ------------------------------------- *
     D dsPaher0_t      ds                  qualified template
     D   r0empr                       1
     D   r0sucu                       2
     D   r0arcd                       6p 0
     D   r0spol                       9p 0
     D   r0sspo                       3p 0
     D   r0rama                       2p 0
     D   r0arse                       2p 0
     D   r0oper                       7p 0
     D   r0poco                       4p 0
     D   r0suop                       3p 0
     D   r0cert                       9p 0
     D   r0poli                       7p 0
     D   r0acrc                       7p 0
     D   r0acrn                       1
     D   r0rpro                       2p 0
     D   r0rdep                       2p 0
     D   r0rloc                       2p 0
     D   r0blck                      10
     D   r0rdes                      30
     D   r0nrdm                       5p 0
     D   r0copo                       5p 0
     D   r0cops                       1p 0
     D   r0suas                      13p 0
     D   r0samo                      13p 0
     D   r0mar1                       1
     D   r0mar2                       1
     D   r0mar3                       1
     D   r0mar4                       1
     D   r0mar5                       1
     D   r0strg                       1
     D   r0user                      10
     D   r0time                       6p 0
     D   r0date                       6p 0
     D   r0suin                       3p 0
     D   r0ainn                       4p 0
     D   r0minn                       2p 0
     D   r0dinn                       2p 0
     D   r0suen                       3p 0
     D   r0aegn                       4p 0
     D   r0megn                       2p 0
     D   r0degn                       2p 0
     D   r0xpro                       3p 0
     D   r0sacm                      15p 2
     D   r0prbp                       5p 2
     D   r0prgp                       5p 2
     D   r0clfr                       4
     D   r0cagr                       2p 0
     D   r0psmp                       5p 0
     D   r0crea                       2
     D   r0ctar                       4p 0
     D   r0cta1                       2
     D   r0cta2                       2
     D   r0cviv                       3p 0

     * - Estructura de PAHER1 ------------------------------------- *
     D dsPaher1_t      ds                  qualified template
     D   r1empr                       1
     D   r1sucu                       2
     D   r1arcd                       6p 0
     D   r1spol                       9p 0
     D   r1sspo                       3p 0
     D   r1rama                       2p 0
     D   r1arse                       2p 0
     D   r1oper                       7p 0
     D   r1poco                       4p 0
     D   r1suop                       3p 0
     D   r1riec                       3
     D   r1xcob                       3p 0
     D   r1secu                       2p 0
     D   r1nomb                      40
     D   r1tido                       2p 0
     D   r1nrdo                       8p 0
     D   r1fnac                       8p 0
     D   r1suas                      13p 0
     D   r1smue                      13p 0
     D   r1sinv                      13p 0
     D   r1mar1                       1
     D   r1mar2                       1
     D   r1mar3                       1
     D   r1mar4                       1
     D   r1mar5                       1
     D   r1user                      10
     D   r1time                       6p 0
     D   r1date                       8p 0

     * - Estructura de PAHER1B ------------------------------------ *
     D dsPaher1B_t     ds                  qualified template
     D   b1empr                       1
     D   b1sucu                       2
     D   b1arcd                       6p 0
     D   b1spol                       9p 0
     D   b1sspo                       3p 0
     D   b1rama                       2p 0
     D   b1arse                       2p 0
     D   b1oper                       7p 0
     D   b1poco                       4p 0
     D   b1suop                       3p 0
     D   b1riec                       3
     D   b1xcob                       3p 0
     D   b1secu                       2p 0
     D   b1sebe                       2p 0
     D   b1nomb                      40
     D   b1tido                       2p 0
     D   b1nrdo                       8p 0
     D   b1mar1                       1
     D   b1mar2                       1
     D   b1mar3                       1
     D   b1mar4                       1
     D   b1mar5                       1
     D   b1user                      10
     D   b1time                       6p 0
     D   b1date                       8p 0

     * - Estructura de PAHER2 ------------------------------------- *
     D dsPaher2_t      ds                  qualified template
     D   r2empr                       1
     D   r2sucu                       2
     D   r2arcd                       6  0
     D   r2spol                       9  0
     D   r2sspo                       3  0
     D   r2rama                       2  0
     D   r2arse                       2  0
     D   r2oper                       7  0
     D   r2poco                       4  0
     D   r2suop                       3p 0
     D   r2riec                       3
     D   r2xcob                       3p 0
     D   r2cert                       9p 0
     D   r2poli                       7p 0
     D   r2saco                      15p 2
     D   r2ptco                      15p 2
     D   r2xpri                       9p 6
     D   r2prsa                       9p 2
     D   r2ecob                       1
     D   r2mar1                       1
     D   r2mar2                       1
     D   r2mar3                       1
     D   r2mar4                       1
     D   r2mar5                       1
     D   r2strg                       1
     D   r2user                      10
     D   r2time                       6p 0
     D   r2date                       6p 0
     D   r2clfr                       4
     D   r2cagr                       2p 0
     D   r2psmp                       5p 2
     D   r2crea                       2
     D   r2ptca                      15p 2
     D   r2xpra                       9p 6

     * - Estructura de PAHER3 ------------------------------------- *
     D dsPaher3_t      ds                  qualified template
     D   r3empr                       1
     D   r3sucu                       2
     D   r3arcd                       6p 0
     D   r3spol                       9p 0
     D   r3sspo                       3p 0
     D   r3rama                       2p 0
     D   r3arse                       2p 0
     D   r3oper                       7p 0
     D   r3poco                       4p 0
     D   r3suop                       3p 0
     D   r3riec                       3
     D   r3xcob                       3p 0
     D   r3nrre                       3p 0
     D   r3retx                      79
     D   r3cert                       9p 0
     D   r3poli                       7p 0
     D   r3mar1                       1
     D   r3mar2                       1
     D   r3mar3                       1
     D   r3mar4                       1
     D   r3mar5                       1
     D   r3strg                       1
     D   r3user                      10
     D   r3time                       6p 0
     D   r3date                       6p 0

     * - Estructura de PAHER4 ------------------------------------- *
     D dsPaher4_t      ds                  qualified template
     D   r4empr                       1
     D   r4sucu                       2
     D   r4arcd                       6p 0
     D   r4spol                       9p 0
     D   r4sspo                       3p 0
     D   r4rama                       2p 0
     D   r4arse                       2p 0
     D   r4oper                       7p 0
     D   r4poco                       4p 0
     D   r4suop                       3p 0
     D   r4xcob                       3p 0
     D   r4nive                       1p 0
     D   r4ccbp                       3p 0
     D   r4reca                       5p 2
     D   r4boni                       5p 2
     D   r4cert                       9p 0
     D   r4poli                       7p 0
     D   r4ma01                       1
     D   r4ma02                       1
     D   r4ma03                       1
     D   r4ma04                       1
     D   r4ma05                       1
     D   r4ma06                       1
     D   r4ma07                       1
     D   r4ma08                       1
     D   r4ma09                       1
     D   r4user                      10
     D   r4date                       8p 0
     D   r4time                       6p 0

     * - Estructura de PAHER5 ------------------------------------- *
     D dsPaher5_t      ds                  qualified template
     D   r5empr                       1
     D   r5sucu                       2
     D   r5arcd                       6p 0
     D   r5spol                       9p 0
     D   r5sspo                       3p 0
     D   r5rama                       2p 0
     D   r5arse                       2p 0
     D   r5oper                       7p 0
     D   r5poco                       4p 0
     D   r5suop                       3p 0
     D   r5cert                       9p 0
     D   r5poli                       7p 0
     D   r5mejo                       4p 0
     D   r5mejl                     490
     D   r5fvto                       8p 0
     D   r5fcum                       8p 0
     D   r5emej                       1
     D   r5mar1                       1
     D   r5mar2                       1
     D   r5mar3                       1
     D   r5mar4                       1
     D   r5mar5                       1
     D   r5mar6                       1
     D   r5mar7                       1
     D   r5mar8                       1
     D   r5mar9                       1
     D   r5mar0                       1
     D   r5user                      10
     D   r5date                       8p 0
     D   r5time                       6p 0

     * - Estructura de PAHER6 ------------------------------------- *
     D dsPaher6_t      ds                  qualified template
     D   r6empr                       1
     D   r6sucu                       2
     D   r6arcd                       6p 0
     D   r6spol                       9p 0
     D   r6sspo                       3p 0
     D   r6rama                       2p 0
     D   r6arse                       2p 0
     D   r6oper                       7p 0
     D   r6poco                       4p 0
     D   r6suop                       3p 0
     D   r6cert                       9p 0
     D   r6poli                       7p 0
     D   r6ccba                       3p 0
     D   r6mar1                       1
     D   r6ma01                       1
     D   r6ma02                       1
     D   r6ma03                       1
     D   r6ma04                       1
     D   r6ma05                       1
     D   r6ma06                       1
     D   r6ma07                       1
     D   r6ma08                       1
     D   r6ma09                       1
     D   r6ma10                       1
     D   r6user                      10
     D   r6date                       8p 0
     D   r6time                       6p 0

     * - Estructura de PAHER7 ------------------------------------- *
     D dsPaher7_t      ds                  qualified template
     D   r7empr                       1
     D   r7sucu                       2
     D   r7arcd                       6p 0
     D   r7spol                       9p 0
     D   r7sspo                       3p 0
     D   r7rama                       2p 0
     D   r7arse                       2p 0
     D   r7oper                       7p 0
     D   r7poco                       4p 0
     D   r7suop                       3p 0
     D   r7riec                       3
     D   r7xcob                       3p 0
     D   r7osec                       9p 0
     D   r7obje                      74
     D   r7marc                      45
     D   r7mode                      45
     D   r7nser                      45p 0
     D   r7suas                      15p 2
     D   r7det1                      74
     D   r7det2                      74
     D   r7det3                      74
     D   r7det4                      74
     D   r7det5                      74
     D   r7det6                      74
     D   r7cert                       9p 0
     D   r7poli                       7p 0
     D   r7mar1                       1
     D   r7mar2                       1
     D   r7mar3                       1
     D   r7mar4                       1
     D   r7mar5                       1
     D   r7mar6                       1
     D   r7mar7                       1
     D   r7mar8                       1
     D   r7mar9                       1
     D   r7mar0                       1
     D   r7strg                       1
     D   r7user                      10
     D   r7time                       6p 0
     D   r7date                       8p 0

     * - Estructura de PAHER8 ------------------------------------- *
     D dsPaher8_t      ds                  qualified template
     D   r8empr                       1
     D   r8sucu                       2
     D   r8arcd                       6p 0
     D   r8spol                       9p 0
     D   r8sspo                       3p 0
     D   r8rama                       2p 0
     D   r8arse                       2p 0
     D   r8oper                       7p 0
     D   r8poco                       4p 0
     D   r8suop                       3p 0
     D   r8xpro                       3p 0
     D   r8riec                       3
     D   r8cobc                       3p 0
     D   r8mone                       2
     D   r8saha                      15p 2
     D   r8cert                       9p 0
     D   r8poli                       7p 0
     D   r8cfra                       2p 0
     D   r8iffi                      15p 2
     D   r8pfva                       5p 2
     D   r8pftf                       5p 2
     D   r8iitf                      15p 2
     D   r8iatf                      15p 2
     D   r8pftv                       5p 2
     D   r8pitv                       5p 2
     D   r8patv                       5p 2
     D   r8mar1                       1
     D   r8mar2                       1
     D   r8mar3                       1
     D   r8mar4                       1
     D   r8mar5                       1
     D   r8mar6                       1
     D   r8mar7                       1
     D   r8mar8                       1
     D   r8mar9                       1
     D   r8mar0                       1
     D   r8user                      10
     D   r8date                       8p 0
     D   r8time                       6p 0

     * - Estructura de PAHER9 ------------------------------------- *
     D dsPaher9_t      ds                  qualified template
     D   r9empr                       1
     D   r9sucu                       2
     D   r9arcd                       6p 0
     D   r9spol                       9p 0
     D   r9sspo                       3p 0
     D   r9rama                       2p 0
     D   r9arse                       2p 0
     D   r9oper                       7p 0
     D   r9poco                       4p 0
     D   r9cert                       9p 0
     D   r9poli                       7p 0
     D   r9acrc                       7p 0
     D   r9acrn                       1
     D   r9rpro                       2p 0
     D   r9rdep                       2p 0
     D   r9rloc                       2p 0
     D   r9blck                      10
     D   r9rdes                      30
     D   r9nrdm                       5p 0
     D   r9copo                       5p 0
     D   r9cops                       1p 0
     D   r9suin                       3p 0
     D   r9ainn                       4p 0
     D   r9minn                       2p 0
     D   r9dinn                       2p 0
     D   r9suen                       3p 0
     D   r9aegn                       4p 0
     D   r9megn                       2p 0
     D   r9degn                       2p 0
     D   r9mar1                       1
     D   r9mar2                       1
     D   r9mar3                       1
     D   r9mar4                       1
     D   r9mar5                       1
     D   r9strg                       1
     D   r9user                      10
     D   r9time                       6p 0
     D   r9date                       6p 0
     D   r9clfr                       4
     D   r9cagr                       2p 0
     D   r9psmp                       5p 2
     D   r9crea                       2

     * - Estructura de PAHER02 ------------------------------------ *
     D dsPaher02_t     ds                  qualified template
     D  r0empr2                       1a
     D  r0sucu2                       2a
     D  r0arcd2                       6p 0
     D  r0spol2                       9p 0
     D  r0sspo2                       3p 0
     D  r0rama2                       2p 0
     D  r0arse2                       2p 0
     D  r0oper2                       7p 0
     D  r0poco2                       4p 0
     D  r0suop2                       3p 0
     D  r0cert2                       9p 0
     D  r0poli2                       7p 0
     D  r0emct2                       3p 0
     D  r0emcn2                      50a
     D  r0emcr2                      10a
     D  r0emcj2                      10a
     D  r0pain2                       5p 0
     D  r0emcf2                      20a
     D  r0emcm2                      25a
     D  r0emca2                       4p 0
     D  r0emcc2                       2p 0
     D  r0emst2                      15p 2
     D  r0emsc2                      15p 2
     D  r0emsm2                      15p 2
     D  r0emc12                       5p 2
     D  r0emc22                       5p 2
     D  r0emc32                       5p 2
     D  r0emc42                      50a
     D  r0emc52                      50a
     D  r0emmm2                      20a
     D  r0emmo2                      25a
     D  r0emmn2                      20a
     D  r0emma2                       4p 0
     D  r0emmp2                       3p 0
     D  r0emmt2                      15a
     D  r0e2mm2                      20a
     D  r0e2mo2                      25a
     D  r0e2mn2                      20a
     D  r0e2ma2                       4p 0
     D  r0e2mp2                       3p 0
     D  r0e2mt2                      15a
     D  r0emcb2                       2p 0
     D  r0mar12                       1a
     D  r0mar22                       1a
     D  r0mar32                       1a
     D  r0mar42                       1a
     D  r0mar52                       1a
     D  r0strg2                       1a
     D  r0user2                      10a
     D  r0time2                       6p 0
     D  r0date2                       6p 0
     D  r0copo2                       5p 0
     D  r0cops2                       1p 0
     D  r0copa2                       5p 0
     D  r0coas2                       1p 0
     D  r0cuit2                      11a
     D  r0fadq2                       8p 0
     D  r0e0km2                       1a
     D  r0emsd2                      15p 2
     D  r0inps2                      10a

     * - Estructura de PAHER92 ------------------------------------ *
     D dsPaher92_t     ds                  qualified template
     D  r9empr2                       1a
     D  r9sucu2                       2a
     D  r9arcd2                       6p 0
     D  r9spol2                       9p 0
     D  r9sspo2                       3p 0
     D  r9rama2                       2p 0
     D  r9arse2                       2p 0
     D  r9oper2                       7p 0
     D  r9poco2                       4p 0
     D  r9cert2                       9p 0
     D  r9poli2                       7p 0
     D  r9emct2                       3p 0
     D  r9emcn2                      50a
     D  r9emcr2                      10a
     D  r9emcj2                      10a
     D  r9pain2                       5p 0
     D  r9emcf2                      20a
     D  r9emcm2                      25a
     D  r9emca2                       4p 0
     D  r9emcc2                       2p 0
     D  r9emst2                      15p 2
     D  r9emsc2                      15p 2
     D  r9emsm2                      15p 2
     D  r9emc12                       5p 2
     D  r9emc22                       5p 2
     D  r9emc32                       5p 2
     D  r9emc42                      50a
     D  r9emc52                      50a
     D  r9emmm2                      20a
     D  r9emmo2                      25a
     D  r9emmn2                      20a
     D  r9emma2                       4p 0
     D  r9emmp2                       3p 0
     D  r9emmt2                      15a
     D  r9e2mm2                      20a
     D  r9e2mo2                      25a
     D  r9e2mn2                      20a
     D  r9e2ma2                       4p 0
     D  r9e2mp2                       3p 0
     D  r9e2mt2                      15a
     D  r9emcb2                       2p 0
     D  r9mar12                       1a
     D  r9mar22                       1a
     D  r9mar32                       1a
     D  r9mar42                       1a
     D  r9mar52                       1a
     D  r9strg2                       1a
     D  r9user2                      10a
     D  r9time2                       6p 0
     D  r9date2                       6p 0
     D  r9copo2                       5p 0
     D  r9cops2                       1p 0
     D  r9copa2                       5p 0
     D  r9coas2                       1p 0
     D  r9cuit2                      11a
     D  r9fadq2                       8p 0
     D  r9e0km2                       1a
     D  r9emsd2                      15p 2
     D  r9inps2                      10a

     * - Estructura de PAHERA ------------------------------------- *
     D dsPahera_t      ds                  qualified template
     D   raempr                       1a
     D   rasucu                       2a
     D   raarcd                       6p 0
     D   raspol                       9p 0
     D   rasspo                       3p 0
     D   rarama                       2p 0
     D   raarse                       2p 0
     D   raoper                       7p 0
     D   rapoco                       4p 0
     D   rasuop                       3p 0
     D   rariec                       3a
     D   raxcob                       3p 0
     D   ramsec                       9p 0
     D   ractma                       2p 0
     D   racraz                       4p 0
     D   rafnaa                       4p 0
     D   rapvac                       1a
     D   racria                       1a
     D   raexpo                       1a
     D   rasuas                      15p 2
     D   racert                       9p 0
     D   rapoli                       7p 0
     D   ramar1                       1a
     D   ramar2                       1a
     D   ramar3                       1a
     D   ramar4                       1a
     D   ramar5                       1a
     D   ramar6                       1a
     D   ramar7                       1a
     D   ramar8                       1a
     D   ramar9                       1a
     D   ramar0                       1a
     D   rastrg                       1a
     D   rauser                      10a
     D   ratime                       6p 0
     D   radate                       8p 0

     * - Estructura de CTWER2 ------------------------------------- *
     D dsCtwer2_t      ds                  qualified template
     D   r2empr                       1
     D   r2sucu                       2
     D   r2nivt                       1p 0
     D   r2nivc                       5p 0
     D   r2nctw                       7p 0
     D   r2rama                       2p 0
     D   r2arse                       2p 0
     D   r2poco                       4p 0
     D   r2riec                       3
     D   r2xcob                       3p 0
     D   r2saco                      15p 2
     D   r2ptco                      15p 2
     D   r2xpri                       9p 6
     D   r2prsa                       9p 2
     D   r2ptca                      15p 2
     D   r2xpra                       9p 6
     D   r2ma01                       1
     D   r2ma02                       1
     D   r2ma03                       1
     D   r2ma04                       1
     D   r2ma05                       1

      *--- Copy H -------------------------------------------------- *
      /copy './qcpybooks/svpemp_h.rpgle'
      /copy './qcpybooks/svppol_h.rpgle'
      /copy './qcpybooks/svpart_h.rpgle'
      /copy './qcpybooks/spvspo_h.rpgle'
      /copy './qcpybooks/svpemi_h.rpgle'
      /copy './qcpybooks/svpdaf_h.rpgle'

     * ------------------------------------------------------------ *
     * SVPRIV_inz(): Inicializa módulo.                             *
     *                                                              *
     * void                                                         *
     * ------------------------------------------------------------ *
     D SVPRIV_inz      pr

     * ------------------------------------------------------------ *
     * SVPRIV_End(): Finaliza módulo.                               *
     *                                                              *
     * void                                                         *
     * ------------------------------------------------------------ *
     D SVPRIV_End      pr

     * ------------------------------------------------------------ *
     * SVPRIV_Error(): Retorna el último error del service program  *
     *                                                              *
     *     peEnbr   (output)  Número de error (opcional)            *
     *                                                              *
     * Retorna: Mensaje de error.                                   *
     * ------------------------------------------------------------ *

     D SVPRIV_Error    pr            80a
     D   peEnbr                      10i 0 options(*nopass:*omit)

     * ------------------------------------------------------------ *
     * SVPRIV_chkSuplemento  : Validar Suplementos                  *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *                                                              *
     * Retorna: *on = Si existe /  *off = No existe                 *
     * ------------------------------------------------------------ *
     D SVPRIV_chkSuplemento...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getSuplementos : Retorna Suplementos                  *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peDsR0   ( output ) Estructura Riesgos Varios (opcional) *
     *     peDsR0C  ( output ) Cantidad de Riesgos       (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getSuplementos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peDsR0                            likeds( dsPaher0_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR0C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_updSuplemento  : Actualizar Suplemento                *
     *                                                              *
     *     peDsR0   ( input  ) Estructura Riesgos Varios            *
     *                                                              *
     * Retorna: *on = Si graba  / *off = No graba                   *
     * ------------------------------------------------------------ *
     D SVPRIV_updSuplemento...
     D                 pr              n
     D   peDsR0                            const likeds( dsPaher0_t )

     * ------------------------------------------------------------ *
     * SVPRIV_setSuplemento  : Grabar Suplementos                   *
     *                                                              *
     *     peDsR0   ( input  ) Estructura Riesgos Varios            *
     *                                                              *
     * Retorna: *on = Si graba  / *off = No graba                   *
     * ------------------------------------------------------------ *
     D SVPRIV_setSuplemento...
     D                 pr              n
     D   peDsR0                            const likeds( dsPaher0_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltSuplemento  : Elimina Suplemento                   *
     *                                                              *
     *     peDsR0   ( input  ) Estructura Riesgos Varios            *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltSuplemento...
     D                 pr              n
     D   peDsR0                            const likeds( dsPaher0_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkPersona  :   Validar Personas.-                    *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkPersona...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getPersonas : Retorna Personas.-                      *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *     peDsR1   ( output ) Est. de Personas          (opcional) *
     *     peDsR1C  ( output ) Cantidad de Personas      (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getPersonas...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const
     D   peDsR1                            likeds( dsPaher1_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR1C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setPersona  : Graba Personas.-                        *
     *                                                              *
     *     peDsR1   ( input  ) Est. de Personas                     *
     *                                                              *
     * Retorna: *on = Si Graba / *off = No Graba                    *
     * ------------------------------------------------------------ *
     D SVPRIV_setPersona...
     D                 pr              n
     D   peDsR1                            const likeds( dsPaher1_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltPersona  : Elimina Persona.-                       *
     *                                                              *
     *     peDsR1   ( input  ) Est. de Personas                     *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltPersona...
     D                 pr              n
     D   peDsR1                            const likeds( dsPaher1_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltPersonas : Elimina Personas.-                      *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *                                                              *
     * Retorna: *on = Si elimino / *off = No elimino                *
     * ------------------------------------------------------------ *
     D SVPRIV_dltPersonas...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_chkBeneficiario :  Validar Beneficiarios.-            *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *     peSebe   ( input  ) Beneficiarios             (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkBeneficiario...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const
     D   peSebe                       2  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getBeneficiarios:  Retorna Beneficiarios.-            *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *     peSebe   ( input  ) Beneficiarios             (opcional) *
     *     peDsB1   ( output ) Beneficiarios             (opcional) *
     *     peDsB1C  ( output ) Beneficiarios             (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getBeneficiarios...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const
     D   peSebe                       2  0 options( *nopass : *omit ) const
     D   peDsB1                            likeds( dsPaher1b_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsB1C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setBeneficiario :  Graba Beneficiarios.-              *
     *                                                              *
     *     peDsB1   ( input  ) Beneficiarios                        *
     *                                                              *
     * Retorna: *on = Si Graba / *off = No Graba                    *
     * ------------------------------------------------------------ *
     D SVPRIV_setBeneficiario...
     D                 pr              n
     D   peDsB1                            const likeds( dsPaher1b_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltBeneficiario :  Elimina Beneficiario.-             *
     *                                                              *
     *     peDsB1   ( input  ) Beneficiarios                        *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltBeneficiario...
     D                 pr              n
     D   peDsB1                            const likeds( dsPaher1B_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltBeneficiarios:  Elimina Beneficiarios.-            *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peSecu   ( input  ) Secuencias                (opcional) *
     *     peSebe   ( input  ) Beneficiarios             (opcional) *
     *                                                              *
     * Retorna: *on = Si elimino / *off = No elimino                *
     * ------------------------------------------------------------ *
     D SVPRIV_dltBeneficiarios...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peSecu                       2  0 options( *nopass : *omit ) const
     D   peSebe                       2  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_chkCobertura  : Validar detalle de Coberturas y       *
     *                        Riesgos.-                             *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkCobertura...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getCoberturas : Retorna detalle de Coberturas y       *
     *                        Riesgos.-                             *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peDsR2   ( output ) Estructura Coberturas     (opcional) *
     *     peDsR2C  ( output ) Cantidad de Coberturas    (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getCoberturas...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peDsR2                            likeds( dsPaher2_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR2C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setCobertura  : Graba detalle de Coberturas y Riesgos *
     *                                                              *
     *     peDsR2   ( input  ) Estructura Coberturas                *
     *                                                              *
     * Retorna: *on = Si graba / *off = No Graba                    *
     * ------------------------------------------------------------ *
     D SVPRIV_setCobertura...
     D                 pr              n
     D   peDsR2                            const likeds( dsPaher2_t )

     * ------------------------------------------------------------ *
     * SVPRIV_updCobertura  : Actualiza detalle de Cobertura  y     *
     *                        Riesgo                                *
     *     peDsR2   ( input  ) Estructura Coberturas                *
     *                                                              *
     * Retorna: *on = Si graba / *off = No Graba                    *
     * ------------------------------------------------------------ *
     D SVPRIV_updCobertura...
     D                 pr              n
     D   peDsR2                            const likeds( dsPaher2_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltCobertura  : Elimina Cobertura  y Riesgo           *
     *                                                              *
     *     peDsR2   ( input  ) Estructura Coberturas                *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltCobertura...
     D                 pr              n
     D   peDsR2                            const likeds( dsPaher2_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkTexto : Validar Textos.-                           *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento                (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cant. de Polizas          (opcional) *
     *     peOper   ( input  ) Código de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro de Componente         (opcional) *
     *     peSuop   ( input  ) Cant.de Polizas           (opcional) *
     *     peRiec   ( input  ) Riesgo                    (opcional) *
     *     peXcob   ( input  ) Cobertura                 (opcional) *
     *     peNrre   ( input  ) Nro. de linea de Texto    (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkTexto...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peNrre                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getTextos: Retorna Textos .-                          *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento                (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cant. de Polizas          (opcional) *
     *     peOper   ( input  ) Código de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro de Componente         (opcional) *
     *     peSuop   ( input  ) Cant.de Polizas           (opcional) *
     *     peRiec   ( input  ) Riesgo                    (opcional) *
     *     peXcob   ( input  ) Cobertura                 (opcional) *
     *     peNrre   ( input  ) Nro. de linea de Texto    (opcional) *
     *     peDsR3   ( output ) Est. Textos               (opcional) *
     *     peDsR3C  ( output ) Cant. Textos              (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getTextos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peNrre                       3  0 options( *nopass : *omit ) const
     D   peDsR3                            likeds( dsPaher3_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR3C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setTexto : Graba Textos                               *
     *                                                              *
     *     peDsR3  (  input  )  Est. Textos                         *
     *                                                              *
     * Retorna: *on = Grabo / *off = No Grabo                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setTexto...
     D                 pr              n
     D   peDsR3                            const likeds( dsPaher3_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltTexto : Elimina Texto .-                           *
     *                                                              *
     *     peDsR3  (  input  )  Est. Textos                         *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltTexto...
     D                 pr              n
     D   peDsR3                            const likeds( dsPaher3_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltTextos: Elimina Textos .-                          *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peSspo   ( input  ) Suplemento                (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cant. de Polizas          (opcional) *
     *     peOper   ( input  ) Código de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro de Componente         (opcional) *
     *     peSuop   ( input  ) Cant.de Polizas           (opcional) *
     *     peRiec   ( input  ) Riesgo                    (opcional) *
     *     peXcob   ( input  ) Cobertura                 (opcional) *
     *     peNrre   ( input  ) Nro. de linea de Texto    (opcional) *
     *                                                              *
     * Retorna: *on = Si Elimino / *off = No Elimino                *
     * ------------------------------------------------------------ *
     D SVPRIV_dltTextos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peNrre                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_chkDescuento  : Validar Descuentos.-                  *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peNive   ( input  ) Nivel de Descuento        (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkDescuento...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peNive                       1  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getDescuentos : Retorna Descuentos.-                  *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peNive   ( input  ) Nivel de descuento        (opcional) *
     *     peDsR4   ( input  ) Est. de Descuentos        (opcional) *
     *     peDsR4C  ( input  ) Cantidad de Descuentos    (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getDescuentos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peNive                       1  0 options( *nopass : *omit ) const
     D   peDsR4                            likeds( dsPaher4_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR4C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setDescuento  : Grabar Descuentos.-                   *
     *                                                              *
     *     peDsR4   ( input  ) Est. de Descuentos                   *
     *                                                              *
     * Retorna: *on = Graba / *off = No graba                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setDescuento...
     D                 pr              n
     D   peDsR4                            const likeds( dsPaher4_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltDescuento  : Eliminar Descuento.-                  *
     *                                                              *
     *     peDsR4   ( input  ) Est. de Descuentos                   *
     *                                                              *
     * Retorna: *on = Elimina / *off = No Elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltDescuento...
     D                 pr              n
     D   peDsR4                            const likeds( dsPaher4_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkMejora : Validar Mejoras.-                         *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peMejo   ( input  ) Mejoras                   (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkMejora...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peMejo                       4  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getMejoras: Retorna Mejoras.-                         *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peMejo   ( input  ) Mejoras                   (opcional) *
     *     peDsr5   ( output ) Est. de Mejoras           (opcional) *
     *     peDsr5C  ( output ) Cantidad de Mejoras       (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getMejoras...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peMejo                       4  0 options( *nopass : *omit ) const
     D   peDsR5                            likeds( dsPaher5_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR5C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setMejora : Graba Mejoras.-                           *
     *                                                              *
     *     peDsr5   ( input  ) Est. de Mejoras                      *
     *                                                              *
     * Retorna: *on = Graba / *off = No Graba                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setMejora...
     D                 pr              n
     D   peDsR5                            const likeds( dsPaher5_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltMejora : Elimina Mejora.-                          *
     *                                                              *
     *     peDsr5   ( input  ) Est. de Mejoras                      *
     *                                                              *
     * Retorna: *on = Elimino / *off = No Elimino                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltMejora...
     D                 pr              n
     D   peDsR5                            const likeds( dsPaher5_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkCaracteristica : Validar Caracteristica.-          *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peCcba   ( input  ) Caracteristica            (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkCaracteristica...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peCcba                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getCaracteristicas: Retorna Caracteristica.-          *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peCcba   ( input  ) Caracteristica            (opcional) *
     *     peDsR6   ( input  ) Est. Caracteristica       (opcional) *
     *     peDsr6C  ( input  ) Cant. Caracteristica      (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getCaracteristicas...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peCcba                       3  0 options( *nopass : *omit ) const
     D   peDsR6                            likeds( dsPaher6_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR6C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setCaracteristica : Graba Caracteristica.-            *
     *                                                              *
     *     peDsr6   ( input  ) Est. de Caracteristicas              *
     *                                                              *
     * Retorna: *on = Graba / *off = No Graba                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setCaracteristica...
     D                 pr              n
     D   peDsR6                            const likeds( dsPaher6_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltCaracteristica : Elimina Caracteristica.-          *
     *                                                              *
     *     peDsr6   ( input  ) Est. de Caracteristica.-             *
     *                                                              *
     * Retorna: *on = Elimino / *off = No Elimino                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltCaracteristica...
     D                 pr              n
     D   peDsR6                            const likeds( dsPaher6_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkObjeto : Validar Objetos.-                         *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peOsec   ( input  ) Objeto                    (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkObjeto...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peOsec                       9  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getObjetos: Retorna Objetos.-                         *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peOsec   ( input  ) Objeto                    (opcional) *
     *     peDsr7   ( input  ) Est. de Objetos           (opcional) *
     *     peDsr7C  ( input  ) Cantidad de Objetos       (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getObjetos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peOsec                       9  0 options( *nopass : *omit ) const
     D   peDsR7                            likeds( dsPaher7_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR7C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setObjeto : Graba Objetos.-                           *
     *                                                              *
     *     peDsr7   ( input  ) Est. de Objetos                      *
     *                                                              *
     * Retorna: *on = Graba / *off = No Graba                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setObjeto...
     D                 pr              n
     D   peDsR7                            const likeds( dsPaher7_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltObjeto : Elimina Objeto.-                          *
     *                                                              *
     *     peDsr7   ( input  ) Est. de Objetos                      *
     *                                                              *
     * Retorna: *on = Elimino / *off = No Elimino                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltObjeto...
     D                 pr              n
     D   peDsR7                            const likeds( dsPaher7_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltObjetos: Elimina Objetos.-                         *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peXcob   ( input  ) Coberturas                (opcional) *
     *     peOsec   ( input  ) Objeto                    (opcional) *
     *                                                              *
     * Retorna: *on = Si elimino / *off = No elimino                *
     * ------------------------------------------------------------ *
     D SVPRIV_dltObjetos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peXcob                       3  0 options( *nopass : *omit ) const
     D   peOsec                       9  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_chkFranquicia : Validar Franquicias.-                 *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peXpro   ( input  ) Producto                  (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peCobc   ( input  ) Cobertura                 (opcional) *
     *     peMone   ( input  ) Moneda                    (opcional) *
     *     peSaha   ( input  ) Franquicia                (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkFranquicia...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peXpro                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peCobc                       3  0 options( *nopass : *omit ) const
     D   peMone                       2    options( *nopass : *omit ) const
     D   peSaha                      15  2 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getFranquicias: Retorna Franquicias.-                 *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peXpro   ( input  ) Producto                  (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peCobc   ( input  ) Cobertura                 (opcional) *
     *     peMone   ( input  ) Moneda                    (opcional) *
     *     peSaha   ( input  ) Franquicia                (opcional) *
     *     peDsR8   ( output ) Est. de Franquicia        (opcional) *
     *     peDsR8C  ( output ) Cant. de Franquicia       (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getFranquicias...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peXpro                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peCobc                       3  0 options( *nopass : *omit ) const
     D   peMone                       2    options( *nopass : *omit ) const
     D   peSaha                      15  2 options( *nopass : *omit ) const
     D   peDsR8                            likeds( dsPaher8_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR8C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setFranquicia : Grabar Franquicias.-                  *
     *                                                              *
     *     peDsR8   ( input  ) Est. de Franquicia                   *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_setFranquicia...
     D                 pr              n
     D   peDsR8                            const likeds( dsPaher8_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltFranquicia : Grabar Franquicia.-                   *
     *                                                              *
     *     peDsR8   ( input  ) Est. de Franquicia                   *
     *                                                              *
     * Retorna: *on = Elimino / *off = No Elimino                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltFranquicia...
     D                 pr              n
     D   peDsR8                            const likeds( dsPaher8_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltFranquicias: Elimina Franquicias.-                 *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peXpro   ( input  ) Producto                  (opcional) *
     *     peRiec   ( input  ) Riesgos                   (opcional) *
     *     peCobc   ( input  ) Cobertura                 (opcional) *
     *     peMone   ( input  ) Moneda                    (opcional) *
     *     peSaha   ( input  ) Franquicia                (opcional) *
     *                                                              *
     * Retorna: *on = Si elimina / *off = No elimino                *
     * ------------------------------------------------------------ *
     D SVPRIV_dltFranquicias...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const
     D   peXpro                       3  0 options( *nopass : *omit ) const
     D   peRiec                       3    options( *nopass : *omit ) const
     D   peCobc                       3  0 options( *nopass : *omit ) const
     D   peMone                       2    options( *nopass : *omit ) const
     D   peSaha                      15  2 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_chkComponente : Validar Componentes.-                 *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_chkComponente...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getComponentes: Retorna Componentes.-                 *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) SuperPoliza                          *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peDsR9   ( output ) Est. de Componente        (opcional) *
     *     peDsR9C  ( output ) Cant. de Componentes      (opcional) *
     *                                                              *
     * Retorna: *on = Si existe / *off = No existe                  *
     * ------------------------------------------------------------ *
     D SVPRIV_getComponentes...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peDsR9                            likeds( dsPaher9_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR9C                     10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_setComponente : Grabar Componentes.-                  *
     *                                                              *
     *     peDsR9   ( input  ) Est. de Componente                   *
     *                                                              *
     * Retorna: *on = Graba / *off = No Graba                       *
     * ------------------------------------------------------------ *
     D SVPRIV_setComponente...
     D                 pr              n
     D   peDsR9                            const likeds( dsPaher9_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltComponente : Eliminar Componente.-                 *
     *                                                              *
     *     peDsR9   ( input  ) Est. de Componente                   *
     *                                                              *
     * Retorna: *on = Elimino / *off = No Elimino                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltComponentes...
     D                 pr              n
     D   peDsR9                            const likeds( dsPaher9_t )

     * ------------------------------------------------------------ *
     * SVPRIV_updComponente : Actualiza Componente.-                *
     *                                                              *
     *     peDsR9   ( input  ) Est. de Componente                   *
     *                                                              *
     * Retorna: *on = Actualizo / *off = No Actualizo               *
     * ------------------------------------------------------------ *
     D SVPRIV_updComponente...
     D                 pr              n
     D   peDsR9                            const likeds( dsPaher9_t )

     * ------------------------------------------------------------ *
     * SVPRIV_calcPremio(): Calculo de Primo                        *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucursal                             *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) Super Poliza                         *
     *     peSspo   ( input  ) Suplemento                           *
     *     peRama   ( input  ) Rama                                 *
     *     peArse   ( input  ) Cant. de Articulos                   *
     *     peOper   ( input  ) Nro. Operacion                       *
     *     peSuop   ( input  ) Suplemento de Operacion              *
     *     peDsIp   ( output ) Importes por Provincia ( opcional )  *
     *     peDsIt   ( output ) Importes Totales       ( opcional )  *
     *     peDsPi   ( output ) % de Importes Totales  ( opcional )  *
     *                                                              *
     * Retorna: Premio / -1 = No Calculó.                           *
     * ------------------------------------------------------------ *
     D SVPRIV_calcPremio...
     D                 pr            15  2
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 const
     D   peRama                       2  0 const
     D   peArse                       2  0 const
     D   peOper                       7  0 const
     D   peSuop                       3  0 const
     D   peDsIp                            likeds (    dsImpEg3_t   ) dim( 30 )
     D                                     options( *omit : *nopass )
     D   peDsIt                            likeds (  dsImpTotales_t )
     D                                     options( *omit : *nopass )
     D   peDsPi                            likeds (   dsPorcImp_t   )
     D                                     options( *omit : *nopass )


     * ------------------------------------------------------------ *
     * SVPRIV_chkCasco:  Validar Casco                              *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *                                                              *
     * Retorna: *on = Si existe /  *off = No existe                 *
     * ------------------------------------------------------------ *
     D SVPRIV_chkCasco...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getCascos: Retorna Informacion de Cascos              *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peSspo   ( input  ) Suplemento Superpoliza    (opcional) *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peSuop   ( input  ) Suplemento Operacion      (opcional) *
     *     peDsR02  ( output ) Estructura Casco          (opcional) *
     *     peDsR02C ( output ) Cantidad de Casco         (opcional) *
     *                                                              *
     * Retorna: *on = Si existe /  *off = No existe                 *
     * ------------------------------------------------------------ *
     D SVPRIV_getCascos...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 options( *nopass : *omit ) const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peSuop                       3  0 options( *nopass : *omit ) const

     D   peDsR02                           likeds( dsPaher02_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR02C                    10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_updCasco:  Actualizar Casco                           *
     *                                                              *
     *     peDsR02  ( input  ) Estructura Casco                     *
     *                                                              *
     * Retorna: *on = Si Actualiza / *off = No Actualiza            *
     * ------------------------------------------------------------ *
     D SVPRIV_updCasco...
     D                 pr              n
     D   peDsR02                           const likeds( dsPaher02_t )

     * ------------------------------------------------------------ *
     * SVPRIV_setCasco : Graba Casco                                *
     *                                                              *
     *     peDsR02  ( input  ) Estructura de Casco                  *
     *                                                              *
     * Retorna: *on = Si graba  / *off = No graba                   *
     * ------------------------------------------------------------ *
     D SVPRIV_setCasco...
     D                 pr              n
     D   peDsR02                           const likeds( dsPaher02_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltCasco : Elimina Casco                              *
     *                                                              *
     *     peDsR02  ( input  ) Estructura Casco                     *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltCasco...
     D                 pr              n
     D   peDsR02                           const likeds( dsPaher02_t )

     * ------------------------------------------------------------ *
     * SVPRIV_chkCascoComponente:  Validar Componente  de Casco     *
     *                                                              *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *                                                              *
     * Retorna: *on = Si existe /  *off = No existe                 *
     * ------------------------------------------------------------ *
     D SVPRIV_chkCascoComponente...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const

     * ------------------------------------------------------------ *
     * SVPRIV_getCascoComponentes: Retorna Informacion de           *
     *                             componentes de un casco          *
     *     peEmpr   ( input  ) Empresa                              *
     *     peSucu   ( input  ) Sucusal                              *
     *     peArcd   ( input  ) Articulo                             *
     *     peSpol   ( input  ) superPoliza                          *
     *     peRama   ( input  ) Rama                      (opcional) *
     *     peArse   ( input  ) Cantidad de polizas       (opcional) *
     *     peOper   ( input  ) Codigo de Operacion       (opcional) *
     *     pePoco   ( input  ) Nro. de Componente        (opcional) *
     *     peDsR92  ( output ) Estructura Casco  Compon. (opcional) *
     *     peDsR92C ( output ) Cantidad de Casco  Comp.  (opcional) *
     *                                                              *
     * Retorna: *on = Si existe /  *off = No existe                 *
     * ------------------------------------------------------------ *
     D SVPRIV_getCascoComponentes...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 options( *nopass : *omit ) const
     D   peArse                       2  0 options( *nopass : *omit ) const
     D   peOper                       7  0 options( *nopass : *omit ) const
     D   pePoco                       4  0 options( *nopass : *omit ) const
     D   peDsR92                           likeds( dsPaher92_t ) dim( 999 )
     D                                     options( *nopass : *omit )
     D   peDsR92C                    10i 0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_updCascoComponente: Actualizar Componente de casco    *
     *                                                              *
     *     peDsR02  ( input  ) Estructura Componente de Casco       *
     *                                                              *
     * Retorna: *on = Si Actualiza / *off = No Actualiza            *
     * ------------------------------------------------------------ *
     D SVPRIV_updCascoComponente...
     D                 pr              n
     D   peDsR92                           const likeds( dsPaher92_t )

     * ------------------------------------------------------------ *
     * SVPRIV_setCascoComponente: Graba Componente de Casco         *
     *                                                              *
     *     peDsR92  ( input  ) Estructura de Componente de Casco    *
     *                                                              *
     * Retorna: *on = Si graba  / *off = No graba                   *
     * ------------------------------------------------------------ *
     D SVPRIV_setCascoComponente...
     D                 pr              n
     D   peDsR92                           const likeds( dsPaher92_t )

     * ------------------------------------------------------------ *
     * SVPRIV_dltCascoComponente: Elimina Componente de Casco       *
     *                                                              *
     *     peDsR92  ( input  ) Estructura Componente de Casco       *
     *                                                              *
     * Retorna: *on = Elimina / *off = No elimina                   *
     * ------------------------------------------------------------ *
     D SVPRIV_dltCascoComponente...
     D                 pr              n
     D   peDsR92                           const likeds( dsPaher92_t )

     * ------------------------------------------------------------ *
     * SVPRIV_getCantComponentesActivos:  Retorna cantidad de       *
     *                                    componentes Activos       *
     *     peEmpr ( input )  Código de Empresa                      *
     *     peSucu ( input )  Código de Sucursal                     *
     *     peArcd ( input )  Código de Articulo                     *
     *     peSpol ( input )  Nro. de Superpoliza                    *
     *     peRama ( input )  Código de Rama              (opcional) *
     *     peArse ( input )  Cant. Polizas por Rama      (opcional) *
     *     peOper ( input )  Nro. Operación              (opcional) *
     *     pePoco ( input )  Nro. de Componente          (opcional) *
     *                                                              *
     * Retorna: 0 = No tiene componentes / >0 Cantidad              *
     * ------------------------------------------------------------ *
     D SVPRIV_getCantComponentesActivos...
     D                 pr            10  0
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 options( *nopass : *omit )
     D   peArse                       2  0 options( *nopass : *omit )
     D   peOper                       7  0 options( *nopass : *omit )
     D   pePoco                       4  0 options( *nopass : *omit )

     * ------------------------------------------------------------ *
     * SVPRIV_getPorcSumaMaxRiesCobe: Retorna porc Máxima por riesgo*
     *                                cobertura                     *
     *     peRama ( input )  Código de Rama                         *
     *     peXpro ( input )  Producto                               *
     *     peRiec ( input )  Riesgo                                 *
     *     peCobc ( input )  Cobertura                              *
     *     peMone ( input )  Moneda                                 *
     *                                                              *
     * Retorna: 0 = No tiene / >0 Porcentaje                        *
     * ------------------------------------------------------------ *
     D SVPRIV_getPorcSumaMaxRiesCobe...
     D                 pr             5  2
     D   peRama                       2  0 const
     D   peXpro                       3  0 const
     D   peRiec                       3    const
     D   peCobc                       3  0 const
     D   peMone                       2    const

      * ------------------------------------------------------------ *
      * SVPRIV_getMascotas: Retorna Mascotas                         *
      *                                                              *
      *     peEmpr   ( input  ) Empresa                              *
      *     peSucu   ( input  ) Sucusal                              *
      *     peArcd   ( input  ) Articulo                             *
      *     peSpol   ( input  ) superPoliza                          *
      *     peSspo   ( input  ) Suplemento Superpoliza               *
      *     peRama   ( input  ) Rama                                 *
      *     peArse   ( input  ) Cantidad de polizas                  *
      *     peOper   ( input  ) Codigo de Operacion                  *
      *     pePoco   ( input  ) Nro. de Componente                   *
      *     peSuop   ( input  ) Suplemento Operacion                 *
      *     peRiec   ( input  ) Riesgo                               *
      *     peXcob   ( input  ) Cobertura                            *
      *     peDsra   ( input  ) Array de Mascotas                    *
      *     peDsraC  ( input  ) Cantidad de Mascotas                 *
      *                                                              *
      * Retorna: *on = Si existe / *off = No existe                  *
      * ------------------------------------------------------------ *
     D SVPRIV_getMascotas...
     D                 pr              n
     D   peEmpr                       1a   const
     D   peSucu                       2a   const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peSspo                       3  0 const
     D   peRama                       2  0 const
     D   peArse                       2  0 const
     D   peOper                       7  0 const
     D   pePoco                       4  0 const
     D   peSuop                       3  0 const
     D   peRiec                       3a   const
     D   peXcob                       3  0 const
     D   peDsRa                            likeds(dsPahera_t) dim(999)
     D   peDsRaC                     10i 0

      * ------------------------------------------------------------ *
      * SVPRIV_isCoberturaBaja : Valida si una cobertura esta dada   *
      *                          de baja                             *
      *                                                              *
      *     peEmpr   ( input  ) Empresa                              *
      *     peSucu   ( input  ) Sucusal                              *
      *     peArcd   ( input  ) Articulo                             *
      *     peSpol   ( input  ) SuperPoliza                          *
      *     peRama   ( input  ) Rama                                 *
      *     peArse   ( input  ) Cantidad de polizas                  *
      *     peOper   ( input  ) Codigo de Operacion                  *
      *     pePoco   ( input  ) Nro. de Componente                   *
      *     peRiec   ( input  ) Riesgos                              *
      *     peXcob   ( input  ) Coberturas                           *
      *     peSspo   ( input  ) Suplemento SuperPoliza ( opcional )  *
      *     peSuop   ( input  ) Suplemento Operacion   ( opcional )  *
      *                                                              *
      * Retorna: *on = Activa / *off = Baja                          *
      * ------------------------------------------------------------ *
     D SVPRIV_isCoberturaBaja...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 const
     D   peArse                       2  0 const
     D   peOper                       7  0 const
     D   pePoco                       4  0 const
     D   peRiec                       3    const
     D   peXcob                       3  0 const
     D   peSspo                       3  0 const options(*nopass:*omit)
     D   peSuop                       3  0 const options(*nopass:*omit)


      * ------------------------------------------------------------ *
      * SVPRIV_getUltimoEstadoComponente():                          *
      *                                                              *
      *     peEmpr   (input)   Cod. Empresa                          *
      *     peSucu   (input)   Cod. Sucursal                         *
      *     peArcd   (input)   Cod. Articulo                         *
      *     peSpol   (input)   Nro. Superpoliza                      *
      *     peRama   (input)   Cod. Rama                             *
      *     peArse   (input)   Cant. Polizas por Rama                *
      *     peOper   (input)   Nro. Operacion                        *
      *     pePoco   (input)   Nro. Componente                       *
      *     peDsR0   (Output)  Registro con PAHET0                   *
      *                                                              *
      * Retorna: *On / *Off                                          *
      * ------------------------------------------------------------ *
     D SVPRIV_getUltimoEstadoComponente...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peArcd                       6  0 const
     D   peSpol                       9  0 const
     D   peRama                       2  0 const
     D   peArse                       2  0 const
     D   peOper                       7  0 const
     D   pePoco                       4  0 const
     D   peDsR0                            likeds(dsPaher0_t)

      * ------------------------------------------------------------ *
      * SVPRIV_getCtwer2: Obtiene datos de Cotizacion Web:           *
      *                   Cobertura de Riegos Varios.-               *
      *                                                              *
      *     peEmpr   (input)   Cod. Empresa                          *
      *     peSucu   (input)   Cod. Sucursal                         *
      *     peNivt   (input)   Tipo Nivel Intermediario              *
      *     peNivc   (input)   Cod. Nivel Intermediario              *
      *     peNctw   (input)   Nro. Cotizacion                       *
      *     peRama   (input)   Cod. Rama                             *
      *     peArse   (input)   Cant. Polizas por Rama                *
      *     pePoco   (input)   Nro. Componente                       *
      *     peRiec   (input)   Cod. Riesgo                           *
      *     peXcob   (input)   Cod. Cobertura                        *
      *     peDsWR2   Output)  Registro con Ctwer2                   *
      *                                                              *
      * Retorna: *On / *Off                                          *
      * ------------------------------------------------------------ *
     D SVPRIV_getCtwer2...
     D                 pr              n
     D   peEmpr                       1    const
     D   peSucu                       2    const
     D   peNivt                       1  0 const
     D   peNivc                       5  0 const
     D   peNctw                       7  0 const
     D   peRama                       2  0 const
     D   peArse                       2  0 const
     D   pePoco                       4  0 const
     D   peRiec                       3    const
     D   peXcob                       3  0 const
     D   peDsWR2                           likeds(dsCtwer2_t)

     * ------------------------------------------------------------ *
     * SVPRIV_updCtwer2: Actualiza Cotización Web:                  *
     *                   Coberturas Riesgos Varios.-                *
     *                                                              *
     *     peDsWr2  ( input  ) Estructura de Ctwer2                 *
     *                                                              *
     * Retorna: *on = Si Actualiza / *off = No Actualiza            *
     * ------------------------------------------------------------ *
     D SVPRIV_updCtwer2...
     D                 pr              n
     D   peDsWr2                           const likeds( dsCtwer2_t )


